# Создание таблицы и получение выборки данных
## Содержание
В этом уроке будет рассмотрен синтаксис и семантика следующих SQL запросов:

* создание таблиц и вставка значений;
* выборка всех данных из таблицы;
* выборка данных из отдельных столбцов;
* выборка отдельных столбцов и присвоение им новых имен;
* создание вычисляемых столбцов;
* вычисляемые столбцы, математические функции;
* вычисляемые столбцы, логические функции;
* выборка данных по простому условию;
* выборка данных с использованием логических выражений и операций;
* выборка данных, операторы BETWEEN, IN;
* выборка текстовых данных по шаблону, оператор LIKE;
* выборка данных с сортировкой.

Структура и наполнение таблицы

Все запросы будут формулироваться для таблицы book:

![table](./images/sql_intro_book_table.png)

## Создание таблицы и заполнение

In [1]:
import pandas as pd
import numpy as np
import mysql.connector

In [2]:
config = {
        'user': 'root',
        'password': 'root',
        'host': 'db',
        'port': 3306,
        'database': 'SQLIntro',
        'charset': 'utf8'
    }

In [3]:
def create_table(query: str) -> None:
    connection = mysql.connector.connect(**config)
    cursor = connection.cursor()
    cursor.execute(query)
    cursor.close()
    connection.close()

In [4]:
def insert_values(query: str) -> None:
    connection = mysql.connector.connect(**config)
    cursor = connection.cursor()
    
    try:
        cursor.execute(query)
        connection.commit()
    except Exception as e:
        print(repr(e))
        connection.rollback()
    finally:
        cursor.close()
        connection.close()

In [9]:
# query = '''
#         CREATE TABLE book(
#                             book_id INT PRIMARY KEY AUTO_INCREMENT,
#                             title   VARCHAR(50),
#                             author  VARCHAR(30),
#                             price   DECIMAL(8, 2),
#                             amount  INT
#                          );
#         '''
# create_table(query)

In [10]:
# query = '''
#         INSERT INTO book (title, author, price, amount) VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3),
#                                                                ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
#                                                                ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
#                                                                ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2),
#                                                                ('Игрок', 'Достоевский Ф.М.', 480.50, 10),
#                                                                ('Стихотворения и поэмы', 'Есенин С.А.', 650.00, 15);

#         '''
# insert_values(query)

## Выборка данных

In [7]:
def select_data(query: str) -> pd.DataFrame:
    connection = mysql.connector.connect(**config)
    df_mysql = pd.read_sql(query, con=connection)
    connection.close()
    return df_mysql

In [11]:
query = '''
        SELECT *
        FROM book;
        '''

select_data(query).style.hide_index()

In [6]:
query = '''
        SELECT author, title, price
        FROM book;
        '''

select_data(query).style.hide_index()

In [7]:
query = '''
        SELECT title as Название, author as Автор
        FROM book;
        '''

select_data(query).style.hide_index()

In [8]:
query = '''
        SELECT title, amount, amount*1.65 AS pack
        FROM book;
        '''
select_data(query).style.hide_index()

In [9]:
query = '''
        SELECT title, author, amount, round(price*0.7, 2) AS new_price
        FROM book;
        '''

select_data(query).style.hide_index()

In [10]:
query = '''
        SELECT author, title,
               round(IF (author='Булгаков М.А.', price*1.10, IF(author='Есенин С.А.', price*1.05, price)), 2) AS new_price
        FROM book;
        '''

select_data(query).style.hide_index()

In [11]:
query = '''
        SELECT author, title, price
        FROM book
        WHERE amount < 10;
        '''

select_data(query).style.hide_index()

In [12]:
query = '''
        SELECT title, author, price, amount
        FROM book
        WHERE price*amount >= 5000 and (price < 500 or price > 600);
        '''

select_data(query).style.hide_index()

In [13]:
query = '''
        SELECT title, author
        FROM book
        WHERE (price BETWEEN 540.50 and 800) and    amount IN (2, 3, 5, 7);
        '''

select_data(query).style.hide_index()

In [14]:
query = '''
        SELECT title, author
        FROM book
        WHERE title LIKE '% %' AND author LIKE '%С.%';
        '''

select_data(query).style.hide_index()

In [15]:
query = '''
        SELECT author, title
        FROM book
        WHERE amount BETWEEN 2 AND 14 
        ORDER BY author DESC, title ASC;
        '''

select_data(query).style.hide_index()

## Group operations

In [16]:
query = '''
        SELECT DISTINCT amount
        FROM book;
        '''

select_data(query).style.hide_index()

In [17]:
query = '''
        SELECT author AS 'Автор', COUNT(author) AS 'Различных_книг', SUM(amount) AS 'Количество_экземпляров'
        FROM book
        GROUP BY author;
        '''

select_data(query).style.hide_index()

In [18]:
query = '''
        SELECT author, MIN(price) AS 'Минимальная цена', MAX(price) AS 'Максимальная цена', AVG(price) AS 'Средняя цена'
        FROM book
        GROUP BY author;
        '''

select_data(query).style.hide_index()

In [19]:
query = '''
        SELECT author, round(SUM(price*amount), 2) AS 'Стоимость', round(SUM(price*amount) * 0.18 / (1 + 0.18), 2) AS 'НДС',
               round(SUM(price*amount) / (1 + 0.18), 2) AS 'Стоимость_без_НДС'
        FROM book
        GROUP BY author;
        '''

select_data(query).style.hide_index()

In [20]:
query = '''
        SELECT MIN(price) AS 'Минимальная_цена', MAX(price) AS 'Максимальная_цена', ROUND(AVG(price), 2) AS 'Средняя_цена'
        FROM book;
        '''

select_data(query).style.hide_index()

In [21]:
query = '''
        SELECT ROUND(AVG(price), 2) AS 'Средняя_цена', ROUND(SUM(price*amount), 2) AS 'Стоимость'
        FROM book
        WHERE amount BETWEEN 5 and 14;
        '''

select_data(query).style.hide_index()

In [22]:
query = '''
        SELECT author, SUM(price*amount) AS 'Стоимость'
        FROM book
        WHERE title <> 'Идиот' and title <> 'Белая гвардия'
        GROUP BY author
        HAVING Стоимость > 5000
        ORDER BY Стоимость DESC;
        '''

select_data(query).style.hide_index()

## Nested queries

In [23]:
query = '''
        SELECT author, title, price
        FROM book
        WHERE price <= (SELECT AVG(price) FROM book)
        ORDER BY price DESC;
        '''

select_data(query).style.hide_index()

In [24]:
query = '''
        SELECT author, title, price
        FROM book
        WHERE price - (SELECT MIN(price) FROM book) <= 150
        ORDER BY price;
        '''

select_data(query).style.hide_index()

In [25]:
query = '''
        SELECT author, title, amount
        FROM book
        WHERE amount IN (SELECT amount FROM book GROUP BY amount HAVING COUNT(amount) = 1);
        '''

select_data(query).style.hide_index()

In [26]:
query = '''
        SELECT author, title, price
        FROM book
        WHERE author = ANY (SELECT author FROM book GROUP BY author HAVING AVG(price) > (SELECT AVG(price) FROM book));
        '''

select_data(query).style.hide_index()

In [27]:
query = '''
        SELECT title, author, amount, (SELECT MAX(amount) FROM book) - amount AS 'Заказ'
        FROM book
        WHERE amount <> (SELECT MAX(amount) FROM book);
        '''

select_data(query).style.hide_index()

In [28]:
query = '''
        SELECT title, author, amount, (SELECT MAX(amount) FROM book) - amount AS 'Заказ'
        FROM book
        WHERE amount <> (SELECT MAX(amount) FROM book);
        '''

select_data(query).style.hide_index()

## Insert and update

In [31]:
# query = '''
#         CREATE TABLE supply(supply_id INT PRIMARY KEY AUTO_INCREMENT,
#                             title VARCHAR(50),
#                             author VARCHAR(30),
#                             price DECIMAL(8, 2),
#                             amount INT);
#         '''
# create_table(query)

In [36]:
query = '''
        INSERT INTO supply (title, author, price, amount) VALUES ('Лирика', 'Пастернак Б.Л.', 518.99, 2),
                                                                 ('Черный человек', 'Есенин С.А.', 570.20, 6),
                                                                 ('Белая гвардия', 'Булгаков М.А.', 540.50, 7),
                                                                 ('Идиот', 'Достоевский Ф.М.', 360.80, 3);
        '''
insert_values(query)

In [37]:
query = '''
        SELECT title, author, price, amount
        FROM supply
        '''

select_data(query).style.hide_index()

In [38]:
query = '''
        INSERT INTO book (title, author, price, amount)
            SELECT title, author, price, amount
            FROM supply
            WHERE author NOT IN ('Булгаков М.А.', 'Достоевский Ф.М.');
        '''

insert_values(query)

In [39]:
query = '''
        SELECT title, author, price, amount
        FROM book
        '''

select_data(query).style.hide_index()

In [40]:
query = '''
        INSERT INTO book (title, author, price, amount)
               SELECT title, author, price, amount
               FROM supply
               WHERE author NOT IN (SELECT author FROM book);
        '''

insert_values(query)

In [41]:
query = '''
        SELECT title, author, price, amount
        FROM book
        '''

select_data(query).style.hide_index()

In [42]:
query = '''
        UPDATE book SET price = 0.9 * price
                    WHERE amount BETWEEN 5 and 10;
        '''

insert_values(query)

In [43]:
query = '''
        SELECT title, author, price, amount
        FROM book
        '''

select_data(query).style.hide_index()

In [45]:

query = '''
        ALTER TABLE book
        ADD COLUMN buy INT DEFAULT 0;
        '''

insert_values(query)

In [48]:
query = '''
        UPDATE book SET buy = IF(title = 'Белая гвардия', 3, IF(title = 'Идиот', 8, IF(title = 'Стихотворения и поэмы', 15, buy)));
        '''

insert_values(query)

In [50]:
query = '''
        UPDATE book SET buy = IF(buy <= amount, buy, amount);
        '''

insert_values(query)

In [51]:
query = '''
        SELECT title, author, price, amount, buy
        FROM book
        '''

select_data(query).style.hide_index()